[
  {
    "id": 1,
    "text": "Vous vous réveillez dans une chambre sombre et inconnue. L'air est lourd et une odeur étrange flotte dans l'atmosphère. Deux portes se dressent devant vous : une à gauche qui semble mener vers un couloir éclairé, et une à droite d'où proviennent d'étranges murmures.",
    "options": [
      {
        "text": "Prendre la porte de gauche vers la lumière",
        "nextText": 2
      },
      {
        "text": "Prendre la porte de droite vers les murmures",
        "nextText": 3
      },
      {
        "text": "Rester dans la chambre et examiner les lieux",
        "nextText": 4
      }
    ]
  },
  {
    "id": 2,
    "text": "Vous empruntez le couloir éclairé. Les néons grésillent au-dessus de votre tête et vous découvrez que vous êtes dans ce qui ressemble à un hôpital abandonné. Des dossiers médicaux jonchent le sol. Vous entendez des pas qui se rapprochent.",
    "options": [
      {
        "text": "Vous cacher dans une chambre adjacente",
        "nextText": 5
      },
      {
        "text": "Continuer d'avancer courageusement",
        "nextText": 6
      },
      {
        "text": "Examiner les dossiers médicaux",
        "nextText": 7
      }
    ]
  },
  {
    "id": 3,
    "text": "Vous suivez les murmures et découvrez un escalier descendant vers les sous-sols. Les voix deviennent plus distinctes... elles semblent réciter des incantations dans une langue inconnue. Une lueur rouge émane d'en bas.",
    "options": [
      {
        "text": "Descendre vers la lueur rouge",
        "nextText": 8
      },
      {
        "text": "Faire demi-tour immédiatement",
        "nextText": 2
      },
      {
        "text": "Écouter attentivement les incantations",
        "nextText": 9
      }
    ]
  },
  {
    "id": 4,
    "text": "En examinant la chambre, vous découvrez un journal personnel sous le lit. En le lisant, vous apprenez que vous êtes dans l'Asylum, un ancien hôpital psychiatrique où des expériences interdites ont eu lieu. Le journal appartient à un ancien patient qui y décrit les horreurs qu'il a vécues.",
    "options": [
      {
        "text": "Continuer la lecture du journal",
        "nextText": 10
      },
      {
        "text": "Quitter la chambre par la porte de gauche",
        "nextText": 2
      },
      {
        "text": "Quitter la chambre par la porte de droite",
        "nextText": 3
      }
    ]
  },
  {
    "id": 5,
    "text": "Vous vous cachez juste à temps. Un garde en blouse blanche passe devant votre cachette en marmonnant des mots incompréhensibles. Il porte une seringue remplie d'un liquide verdâtre. Une fois qu'il est parti, vous remarquez qu'il a laissé tomber un trousseau de clés.",
    "options": [
      {
        "text": "Prendre les clés et suivre le garde",
        "nextText": 11
      },
      {
        "text": "Prendre les clés et explorer dans l'autre direction",
        "nextText": 12
      },
      {
        "text": "Laisser les clés et partir discrètement",
        "nextText": 6
      }
    ]
  },
  {
    "id": 6,
    "text": "Vous avancez dans le couloir et atteignez un hall central. Plusieurs couloirs partent dans différentes directions : 'Laboratoire', 'Salles de traitement', 'Quartier d'isolement'. Un panneau défraîchi indique 'Sortie' mais la flèche semble pointer vers le quartier d'isolement.",
    "options": [
      {
        "text": "Aller vers le laboratoire",
        "nextText": 13
      },
      {
        "text": "Aller vers les salles de traitement",
        "nextText": 14
      },
      {
        "text": "Suivre la direction 'Sortie' vers l'isolement",
        "nextText": 15
      }
    ]
  },
  {
    "id": 7,
    "text": "Les dossiers révèlent des expériences terrifiantes : modification de la mémoire, implants cérébraux, tests de substances psychotropes. Votre propre nom apparaît sur l'un des dossiers. Selon le document, vous êtes le 'Sujet 42' et l'expérience en cours est 'Test de résistance psychologique'.",
    "options": [
      {
        "text": "Chercher d'autres informations sur vous-même",
        "nextText": 16
      },
      {
        "text": "Fuir immédiatement",
        "nextText": 6
      },
      {
        "text": "Détruire votre dossier",
        "nextText": 17
      }
    ]
  },
  {
    "id": 8,
    "text": "Vous descendez vers la lueur rouge et découvrez une salle rituelle. Des symboles étranges sont gravés sur les murs et plusieurs personnes en robes noires sont rassemblées autour d'un autel. Elles ne vous ont pas encore remarqué, mais l'une d'elles se retourne lentement...",
    "options": [
      {
        "text": "Vous enfuir en courant",
        "nextText": 18
      },
      {
        "text": "Vous approcher discrètement",
        "nextText": 19
      },
      {
        "text": "Crier pour interrompre le rituel",
        "nextText": 20
      }
    ]
  },
  {
    "id": 9,
    "text": "En écoutant attentivement, vous commencez à comprendre certains mots. Ils parlent d'un 'réveil', d'une 'transcendance' et mentionnent votre nom. Il semblerait que ce rituel soit lié à votre présence ici. Soudain, l'une des voix s'arrête et dit : 'Il nous écoute.'",
    "options": [
      {
        "text": "Vous révéler et descendre",
        "nextText": 21
      },
      {
        "text": "Partir silencieusement",
        "nextText": 2
      },
      {
        "text": "Rester et continuer d'écouter",
        "nextText": 22
      }
    ]
  },
  {
    "id": 10,
    "text": "Le journal révèle la vérité terrifiante : l'Asylum n'a jamais fermé. Les expériences continuent et vous êtes le dernier 'patient' de leur programme. Le seul moyen de s'échapper est de trouver la salle de contrôle principale et de désactiver le système de sécurité. Mais attention, ils savent que vous savez...",
    "options": [
      {
        "text": "Chercher la salle de contrôle",
        "nextText": 23
      },
      {
        "text": "Essayer de contacter l'extérieur",
        "nextText": 24
      },
      {
        "text": "Affronter directement vos geôliers",
        "nextText": 25
      }
    ]
  },
  {
    "id": 11,
    "text": "Vous suivez discrètement le garde. Il se dirige vers une section sécurisée de l'hôpital. Les clés vous permettent d'ouvrir plusieurs portes verrouillées. Vous découvrez des cellules où d'autres patients sont retenus prisonniers.",
    "options": [
      {
        "text": "Libérer les autres patients",
        "nextText": 23
      },
      {
        "text": "Continuer à suivre le garde",
        "nextText": 25
      },
      {
        "text": "Retourner sur vos pas",
        "nextText": 6
      }
    ]
  },
  {
    "id": 12,
    "text": "Avec les clés, vous explorez dans la direction opposée. Vous trouvez un bureau abandonné avec un ordinateur encore allumé. Sur l'écran, vous voyez les plans de l'asylum et une liste de tous les patients. Votre nom y figure.",
    "options": [
      {
        "text": "Étudier les plans pour trouver une sortie",
        "nextText": 23
      },
      {
        "text": "Rechercher des informations sur les autres patients",
        "nextText": 24
      },
      {
        "text": "Détruire les fichiers informatiques",
        "nextText": 25
      }
    ]
  },
  {
    "id": 13,
    "text": "Le laboratoire est rempli d'équipements étranges et de bocaux contenant des spécimens inquiétants. Sur une table, vous trouvez des seringues et des flacons étiquetés avec des noms de code. Une porte au fond mène vers une salle d'opération.",
    "options": [
      {
        "text": "Examiner les spécimens",
        "nextText": 25
      },
      {
        "text": "Entrer dans la salle d'opération",
        "nextText": 18
      },
      {
        "text": "Prendre une seringue comme arme",
        "nextText": 23
      }
    ]
  },
  {
    "id": 14,
    "text": "Les salles de traitement révèlent l'horreur des expériences menées ici. Des machines électriques, des appareils de contention, et sur les murs, des photos avant/après des patients. Vous entendez des gémissements venant d'une salle adjacente.",
    "options": [
      {
        "text": "Investiguer les gémissements",
        "nextText": 11
      },
      {
        "text": "Détruire les machines",
        "nextText": 25
      },
      {
        "text": "Fuir immédiatement",
        "nextText": 6
      }
    ]
  },
  {
    "id": 15,
    "text": "Le quartier d'isolement est sinistre. Des cellules capitonnées s'alignent le long d'un couloir sombre. Au bout du couloir, vous apercevez une lumière et ce qui semble être une sortie de secours. Mais des cris proviennent des cellules.",
    "options": [
      {
        "text": "Se diriger vers la sortie",
        "nextText": 23
      },
      {
        "text": "Vérifier les cellules",
        "nextText": 11
      },
      {
        "text": "Écouter attentivement les cris",
        "nextText": 24
      }
    ]
  },
  {
    "id": 16,
    "text": "Vous foulez parmi les dossiers et découvrez votre dossier complet. Vous apprenez que vous êtes ici depuis des mois, que votre mémoire a été effacée plusieurs fois, et que cette 'évasion' fait partie de l'expérience.",
    "options": [
      {
        "text": "Refuser de croire ces informations",
        "nextText": 23
      },
      {
        "text": "Accepter la réalité et chercher une vraie sortie",
        "nextText": 24
      },
      {
        "text": "Confronter vos geôliers",
        "nextText": 25
      }
    ]
  },
  {
    "id": 17,
    "text": "Vous détruisez votre dossier, mais en le déchirant, vous découvrez un message caché à l'intérieur : 'Ils nous observent. La vraie sortie est dans le sous-sol. Signé : Un ami.' Ce message semble authentique.",
    "options": [
      {
        "text": "Aller vers le sous-sol",
        "nextText": 8
      },
      {
        "text": "Ignorer le message",
        "nextText": 6
      },
      {
        "text": "Chercher d'autres messages cachés",
        "nextText": 24
      }
    ]
  },
  {
    "id": 18,
    "text": "Votre fuite précipitée alerte les cultistes. Ils se lancent à votre poursuite dans les couloirs sombres de l'asylum. Leurs cris résonnent derrière vous alors que vous courez aveuglément, cherchant désespérément une issue. Vous êtes rattrapé.",
    "options": [
      {
        "text": "Recommencer",
        "nextText": -1
      }
    ]
  },
  {
    "id": 19,
    "text": "Vous vous approchez discrètement du rituel. Les cultistes invoquent quelque chose d'ancien et de terrible. Soudain, vous réalisez qu'ils tentent de vous ressusciter... mais vous êtes déjà vivant. Ou le croyiez-vous ?",
    "options": [
      {
        "text": "Interrompre le rituel",
        "nextText": 25
      },
      {
        "text": "Observer jusqu'au bout",
        "nextText": 24
      },
      {
        "text": "S'enfuir silencieusement",
        "nextText": 2
      }
    ]
  },
  {
    "id": 20,
    "text": "Votre cri interrompt le rituel. Les cultistes se retournent vers vous avec des visages déformés par la colère. Leur chef s'avance : 'Tu as tout gâché ! Le processus était presque terminé !' Ils vous entourent.",
    "options": [
      {
        "text": "Négocier avec eux",
        "nextText": 24
      },
      {
        "text": "Tenter de s'échapper",
        "nextText": 18
      },
      {
        "text": "Les affronter",
        "nextText": 25
      }
    ]
  },
  {
    "id": 21,
    "text": "Vous descendez et vous révélez aux cultistes. Ils vous accueillent comme s'ils vous attendaient : 'Enfin, le sujet est prêt. Le processus de renaissance peut commencer.' Vous réalisez que tout ceci était planifié.",
    "options": [
      {
        "text": "Accepter votre sort",
        "nextText": 25
      },
      {
        "text": "Tenter une dernière évasion",
        "nextText": 23
      },
      {
        "text": "Demander des explications",
        "nextText": 24
      }
    ]
  },
  {
    "id": 22,
    "text": "Vous restez caché et écoutez. Le rituel révèle la vérité : vous êtes mort depuis longtemps, et ils tentent de ramener votre âme dans ce corps. L'asylum est un lieu entre les mondes. Vous avez le choix : accepter ou résister.",
    "options": [
      {
        "text": "Accepter la renaissance",
        "nextText": 24
      },
      {
        "text": "Résister et rester mort",
        "nextText": 23
      },
      {
        "text": "Chercher une troisième voie",
        "nextText": 25
      }
    ]
  },
  {
    "id": 23,
    "text": "Après de longues recherches, vous trouvez la salle de contrôle. Vous réussissez à désactiver le système et les portes de l'asylum s'ouvrent enfin. Vous vous échappez dans la nuit, libre mais marqué à vie par cette expérience. Vous avez survécu à l'Asylum.",
    "options": [
      {
        "text": "Recommencer",
        "nextText": -1
      }
    ]
  },
  {
    "id": 24,
    "text": "Vous découvrez la vérité sur l'Asylum : c'est un centre de recherche sur la conscience et la mort. Vous étiez un volontaire qui a accepté de tester la frontière entre vie et mort. L'expérience est terminée, vous pouvez choisir de garder ou d'effacer ces souvenirs.",
    "options": [
      {
        "text": "Garder les souvenirs",
        "nextText": 23
      },
      {
        "text": "Effacer les souvenirs",
        "nextText": -1
      }
    ]
  },
  {
    "id": 25,
    "text": "Votre confrontation directe avec les responsables de l'asylum se solde par un échec. Vous êtes capturé et reconduit vers les laboratoires pour subir des expériences encore plus terrifiantes. Votre résistance n'a fait qu'attiser leur curiosité scientifique.",
    "options": [
      {
        "text": "Recommencer",
        "nextText": -1
      }
    ]
  }
]
